[imperva:waf]
TRANSFORMS-0_branch_source_type = imperva_waf_branch_source_type_1, imperva_waf_branch_source_type_2, imperva_waf_branch_source_type_3
REPORT-4_extract_field = cef_format_extract_field_0, cef_format_extract_field_1, cef_format_extract_field_2, cef_format_extract_field_3, cef_format_extract_field_4, cef_format_extract_field_5, cef_format_extract_field_6, cef_format_extract_field_7
EXTRACT-5_extract_field = [\s,]+(?P<dvc>[^\s,]+)[\s,]+CEF
EVAL-extend_part=coalesce(extend_part_1,"")." ".coalesce(extend_part_2,"")
EVAL-dest_ip = if(isnotnull(dst), dst, if(isnotnull(dstIP), dstIP, dvc))
EVAL-dest = if((isnotnull(ApplicationName) AND ApplicationName!= ""), ApplicationName, dst)
EVAL-dest_port = if(isnotnull(dpt), dpt, dstPort)
EVAL-src_port = if(isnotnull(spt), spt, srcPort)
EVAL-user = if(isnotnull(suser), suser, if(isnotnull(username), username, duser))
EVAL-vendor_action = if(isnotnull(act), act, disposition)
EVAL-policy = if(isnotnull(Policy), Policy, policyName)
EVAL-raw_severity = if(isnotnull(raw_severity), raw_severity, alertSev)
EVAL-url = if(isnotnull(url), url, request)
EVAL-signature = if(isnotnull(Description), Description, evntDesc)
EVAL-url_length = if(isnotnull(url), len(url), url_length)
EVAL-transport = lower(proto)
EVAL-type = if(cat == "SystemEvent", "event", type)
EVAL-body = if(isnotnull(name), name, message)
EVAL-protocol = if(alertType == "Firewall", "ip", protocol)
EVAL-rule = if(isnotnull(rule), rule, policy)
EVAL-vendor = replace(vendor, "(\s*Inc\.)", "")
EVAL-vendor_product = replace(vendor, "(\s*Inc\.)", "") + " " + product
EVAL-app = if(isnotnull(app), app, product)
EVAL-ids_type = "network"
FIELDALIAS-category = name as category
FIELDALIAS-7_alias_fields = ApplicationName as application_name
FIELDALIAS-8_alias_fields = ApplicationName as app
FIELDALIAS-9_alias_fields = ServiceName as service_name
FIELDALIAS-10_alias_fields = ServerGroup as server_group
FIELDALIAS-11_alias_fields = dntdom as dest_nt_domain
FIELDALIAS-12_alias_fields = dmac as dest_mac
FIELDALIAS-13_alias_fields = srcntdom as src_nt_domain
FIELDALIAS-14_alias_fields = smac as src_mac
FIELDALIAS-15_alias_fields = shost as src_dns
FIELDALIAS-16_alias_fields = out as bytes_out
FIELDALIAS-17_alias_fields = end as end_time
FIELDALIAS-18_alias_fields = start as start_time
FIELDALIAS-19_alias_fields = suid as user_id
FIELDALIAS-20_alias_fields = fsize as file_size
FIELDALIAS-21_alias_fields = dproc as process
FIELDALIAS-22_alias_fields = fname as file_name
FIELDALIAS-23_alias_fields = dhost as dest_dns
FIELDALIAS-25_alias_fields = src as src_ip
LOOKUP-25_look_up_extract = imperva_waf_severity_lookup raw_severity OUTPUT severity
LOOKUP-26_look_up_extract = imperva_waf_actions_lookup vendor_action OUTPUT action
KV_MODE = none
SHOULD_LINEMERGE = false
# for load balancing on UF
EVENT_BREAKER_ENABLE = true

[imperva:waf:security:cef]
REPORT-0_extract_field = cef_format_extract_field_0, cef_format_extract_field_1, cef_format_extract_field_2, cef_format_extract_field_3, cef_format_extract_field_4, cef_format_extract_field_5, cef_format_extract_field_6, cef_format_extract_field_7
EXTRACT-1_extract_field = [\s,]+(?P<dvc>[^\s,]+)[\s,]+CEF
EVAL-extend_part=coalesce(extend_part_1,"")." ".coalesce(extend_part_2,"")
EVAL-vendor = replace(vendor, "(\s*Inc\.)", "")
EVAL-vendor_product = replace(vendor, "(\s*Inc\.)", "") + " " + product
EVAL-app = if(isnotnull(app), app, product)
EVAL-transport = lower(proto)
EVAL-url_length = if(isnotnull(url), len(url), url_length)
EVAL-ids_type = "network"
EVAL-dest = if((isnotnull(ApplicationName) AND ApplicationName!= ""), ApplicationName, dst)
FIELDALIAS-category = name as category
FIELDALIAS-3_alias_fields = ApplicationName as application_name
FIELDALIAS-4_alias_fields = ApplicationName as app
FIELDALIAS-5_alias_fields = ServiceName as service_name
FIELDALIAS-6_alias_fields = ServerGroup as server_group
FIELDALIAS-7_alias_fields = dpt as dest_port
FIELDALIAS-8_alias_fields = Description as signature
FIELDALIAS-9_alias_fields = dst as dest_ip
FIELDALIAS-10_alias_fields = spt as src_port
FIELDALIAS-11_alias_fields = duser as user
FIELDALIAS-12_alias_fields = act as vendor_action
FIELDALIAS-13_alias_fields = Policy as policy
FIELDALIAS-14_alias_fields = src as src_ip
LOOKUP-15_look_up_extract = imperva_waf_severity_lookup raw_severity OUTPUT severity
LOOKUP-16_look_up_extract = imperva_waf_actions_lookup vendor_action OUTPUT action
KV_MODE = none
SHOULD_LINEMERGE = false

[imperva:waf:system:cef]
REPORT-0_extract_field = cef_format_extract_field_0, cef_format_extract_field_1, cef_format_extract_field_2, cef_format_extract_field_3, cef_format_extract_field_4, cef_format_extract_field_5, cef_format_extract_field_6
REPORT-1_extract_login_failed_event_fields = imperva_waf_system_log_in_failed
EXTRACT-1_extract_field = [\s,]+(?P<dvc>[^\s,]+)[\s,]+CEF
EVAL-extend_part=coalesce(extend_part_1,"")." ".coalesce(extend_part_2,"")
EVAL-vendor = replace(vendor, "(\s*Inc\.)", "")
EVAL-vendor_product = replace(vendor, "(\s*Inc\.)", "") + " " + product
EVAL-user = if(isnotnull(user), user, suser)
EVAL-category = if(isnotnull(category), category, alertType)
EVAL-app = if(isnotnull(app), app, product)
EVAL-type = "event"
FIELDALIAS-2_alias_fields = alertType as type
FIELDALIAS-3_alias_fields = name as body
FIELDALIAS-4_alias_fields = dvc as dest
FIELDALIAS-5_alias_fields = suser as src_user
LOOKUP-6_look_up_extract = imperva_waf_severity_lookup raw_severity OUTPUT severity
KV_MODE = none
SHOULD_LINEMERGE = false

[imperva:waf:firewall:cef]
REPORT-0_extract_field = cef_format_extract_field_0, cef_format_extract_field_1, cef_format_extract_field_2, cef_format_extract_field_3, cef_format_extract_field_4, cef_format_extract_field_5, cef_format_extract_field_6
EXTRACT-1_extract_field = [\s,]+(?P<dvc>[^\s,]+)[\s,]+CEF
EVAL-extend_part=coalesce(extend_part_1,"")." ".coalesce(extend_part_2,"")
EVAL-vendor = replace(vendor, "(\s*Inc\.)", "")
EVAL-vendor_product = replace(vendor, "(\s*Inc\.)", "") + " " + product
EVAL-app = if(isnotnull(app), app, product)
EVAL-ids_type = "network"
EVAL-transport = lower(proto)
EVAL-url_length = if(isnotnull(url), len(url), url_length)
EVAL-protocol = "ip"
EVAL-rule = if(isnotnull(rule), rule, policy)
EVAL-dest = if((isnotnull(ApplicationName) AND ApplicationName!= ""), ApplicationName, dst)
FIELDALIAS-category = name as category
FIELDALIAS-2_alias_fields = ApplicationName as application_name
FIELDALIAS-3_alias_fields = ApplicationName as app
FIELDALIAS-4_alias_fields = ServiceName as service_name
FIELDALIAS-5_alias_fields = ServerGroup as server_group
FIELDALIAS-6_alias_fields = dpt as dest_port
FIELDALIAS-7_alias_fields = Description as signature
FIELDALIAS-8_alias_fields = dst as dest_ip
FIELDALIAS-9_alias_fields = spt as src_port
FIELDALIAS-10_alias_fields = duser as user
FIELDALIAS-11_alias_fields = act as vendor_action
FIELDALIAS-12_alias_fields = Policy as policy
FIELDALIAS-13_alias_fields = src as src_ip
LOOKUP-14_look_up_extract = imperva_waf_severity_lookup raw_severity OUTPUT severity
LOOKUP-15_look_up_extract = imperva_waf_actions_lookup vendor_action OUTPUT action
KV_MODE = none
SHOULD_LINEMERGE = false

[imperva_waf]
rename = imperva:waf

