##
## SPDX-FileCopyrightText: 2024 Splunk, Inc.
## SPDX-License-Identifier: LicenseRef-Splunk-8-2021
##
##

[(?:::){0}snow:*]
MAX_TIMESTAMP_LOOKAHEAD = 19
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d %H:%M:%S
TZ = UTC
REPORT-sys_id = sys_id

[snow:incident]
FIELDALIAS-ticket_id = number AS ticket_id
FIELDALIAS-description = short_description AS description
FIELDALIAS-dest = endpoint AS dest
FIELDALIAS-src_user = sys_created_by AS src_user
FIELDALIAS-time_submitted = sys_created_on AS time_submitted
FIELDALIAS-incident = short_description AS incident
FIELDALIAS-id_severity = severity AS severity_id

# For display_value = false, override the following with blank value in local/props.conf under the corresponding stanza. e.g. "FIELDALIAS-assignment_group_name = " without quotes
FIELDALIAS-assignment_group_name = dv_assignment_group AS assignment_group_name
FIELDALIAS-incident_state_name = dv_state AS incident_state_name
FIELDALIAS-affect_dest = dv_cmdb_ci AS affect_dest
FIELDALIAS-assignment_user_name = dv_assigned_to AS assignment_user_name
FIELDALIAS-name = dv_caller_id AS name
FIELDALIAS-severity = dv_severity AS severity
FIELDALIAS-status = dv_state AS status
FIELDALIAS-user = dv_assigned_to AS user
EVAL-priority = coalesce(dv_priority, priority)
EVAL-source_workflowaction = ltrim(source,"https://")

LOOKUP-location = snow_cmn_location_list_lookup sys_id AS location OUTPUTNEW latitude, longitude, full_name AS location_name
LOOKUP-user = snow_sys_user_list_lookup sys_id AS assigned_to OUTPUTNEW user_name AS assignment_user_username
LOOKUP-user2 = snow_sys_user_list_lookup sys_id AS caller_id OUTPUTNEW user_name AS user

# For display_value = false, add the following as it is in local/props.conf and uncomment under the corresponding stanza.
#LOOKUP-assignment_group = snow_sys_user_group_list_lookup sys_id AS assignment_group OUTPUTNEW name AS assignment_group_name
#LOOKUP-location = snow_cmn_location_list_lookup sys_id AS location OUTPUTNEW latitude, longitude, full_name AS location_name
#LOOKUP-user = snow_sys_user_list_lookup sys_id AS assigned_to OUTPUTNEW user_name AS assignment_user_username, name AS assignment_user_name
#LOOKUP-user2 = snow_sys_user_list_lookup sys_id AS caller_id OUTPUTNEW user_name AS user, name AS name
#LOOKUP-affect_dest = snow_cmdb_ci_list_lookup sys_id AS cmdb_ci OUTPUTNEW name AS affect_dest
#LOOKUP-incident_state = snow_incident_state_lookup state OUTPUTNEW incident_state_name


[snow:change_request]
FIELDALIAS-ticket_id = number AS ticket_id
FIELDALIAS-description = short_description AS description
FIELDALIAS-dest = endpoint AS dest
FIELDALIAS-src_user = sys_created_by AS src_user
FIELDALIAS-time_submitted = sys_created_on AS time_submitted
FIELDALIAS-change = short_description AS change

# For display_value = false, override the following with blank value in local/props.conf under the corresponding stanza. e.g. "FIELDALIAS-assignment_group_name = " without quotes
FIELDALIAS-assignment_group_name = dv_assignment_group AS assignment_group_name
FIELDALIAS-assigned_to_name = dv_assigned_to AS assigned_to_name
FIELDALIAS-user = dv_assigned_to AS user
FIELDALIAS-affect_dest = dv_cmdb_ci AS affect_dest
FIELDALIAS-change_state_name = dv_state AS change_state_name
FIELDALIAS-status = dv_state AS status
EVAL-priority = coalesce(dv_priority, priority)
EVAL-source_workflowaction = ltrim(source,"https://")

# For display_value = false, add the following as it is in local/props.conf and uncomment under the corresponding stanza.
#LOOKUP-assignment_group = snow_sys_user_group_list_lookup sys_id AS assignment_group OUTPUTNEW name AS assignment_group_name
#LOOKUP-user = snow_sys_user_list_lookup sys_id AS assigned_to OUTPUTNEW name AS assigned_to_name
#LOOKUP-user2 = snow_sys_user_list_lookup sys_id AS assigned_to OUTPUTNEW name AS user
#LOOKUP-affect_dest = snow_cmdb_ci_list_lookup sys_id AS cmdb_ci OUTPUTNEW name AS affect_dest
#LOOKUP-change_state = snow_change_state_lookup state OUTPUTNEW change_state_name


[snow:change_task]
FIELDALIAS-ticket_id = number AS ticket_id
FIELDALIAS-description = short_description AS description
FIELDALIAS-dest = endpoint AS dest
FIELDALIAS-src_user = sys_created_by AS src_user
FIELDALIAS-time_submitted = sys_created_on AS time_submitted
FIELDALIAS-change = short_description AS change

# For display_value = false, override the following with blank value in local/props.conf under the corresponding stanza. e.g. "FIELDALIAS-assignment_group_name = " without quotes
FIELDALIAS-assignment_group_name = dv_assignment_group AS assignment_group_name
FIELDALIAS-assigned_to_name = dv_assigned_to AS assigned_to_name
FIELDALIAS-user = dv_assigned_to AS user
FIELDALIAS-affect_dest = dv_cmdb_ci AS affect_dest
FIELDALIAS-change_state_name = dv_state AS change_state_name
FIELDALIAS-status = dv_state AS status
EVAL-priority = coalesce(dv_priority, priority)
EVAL-source_workflowaction = ltrim(source,"https://")

# For display_value = false, add the following as it is in local/props.conf and uncomment under the corresponding stanza.
#LOOKUP-assignment_group = snow_sys_user_group_list_lookup sys_id AS assignment_group OUTPUTNEW name AS assignment_group_name
#LOOKUP-user = snow_sys_user_list_lookup sys_id AS assigned_to OUTPUTNEW name AS assigned_to_name
#LOOKUP-user2 = snow_sys_user_list_lookup sys_id AS assigned_to OUTPUTNEW name AS user
#LOOKUP-affect_dest = snow_cmdb_ci_list_lookup sys_id AS cmdb_ci OUTPUTNEW name AS affect_dest
#LOOKUP-change_state = snow_change_state_lookup state OUTPUTNEW change_state_name


[snow:problem]
FIELDALIAS-ticket_id = number AS ticket_id
FIELDALIAS-description = short_description AS description
FIELDALIAS-dest = endpoint AS dest
FIELDALIAS-src_user = sys_created_by AS src_user
FIELDALIAS-time_submitted = sys_created_on AS time_submitted
FIELDALIAS-problem = short_description AS problem

# For display_value = false, override the following with blank value in local/props.conf under the corresponding stanza. e.g. "FIELDALIAS-assignment_group_name = " without quotes
FIELDALIAS-assignment_group_name = dv_assignment_group AS assignment_group_name
FIELDALIAS-assigned_to_name = dv_assigned_to AS assigned_to_name
FIELDALIAS-name = dv_assigned_to AS name
FIELDALIAS-affect_dest = dv_cmdb_ci AS affect_dest
FIELDALIAS-problem_state_name = dv_state AS problem_state_name
FIELDALIAS-status = dv_state AS status
FIELDALIAS-user = dv_assigned_to AS user
EVAL-priority = coalesce(dv_priority, priority)
EVAL-source_workflowaction = ltrim(source,"https://")

LOOKUP-user_name = snow_sys_user_list_lookup sys_id AS assigned_to OUTPUTNEW user_name AS user

# For display_value = false, add the following as it is in local/props.conf and uncomment under the corresponding stanza.
#LOOKUP-assignment_group = snow_sys_user_group_list_lookup sys_id AS assignment_group OUTPUTNEW name AS assignment_group_name
#LOOKUP-user = snow_sys_user_list_lookup sys_id AS assigned_to OUTPUTNEW name AS assigned_to_name
#LOOKUP-user2 = snow_sys_user_list_lookup sys_id AS assigned_to OUTPUTNEW name AS name, user_name AS user
#LOOKUP-affect_dest = snow_cmdb_ci_list_lookup sys_id AS cmdb_ci OUTPUTNEW name AS affect_dest
#LOOKUP-problem_state = snow_problem_state_lookup problem_state OUTPUTNEW problem_state_name

[snow:sysevent]
EVAL-action = case(name=="login", "success", name=="login.failed", "failure", name=="text_index" AND parm2=="insert", "created", name=="text_index" AND parm2=="delete", "deleted", name=="text_index" AND parm2=="update", "modified", name=="logout", "logoff", name=="ais_index" AND parm2=="update", "modified", name=="sys_user.insert", "created", name=="sys_user.delete", "deleted", true(), null())
EVAL-app = if(like(name, "login%"), "servicenow", null())
FIELDALIAS-dest = endpoint AS dest
EVAL-dest_nt_domain = case(name IN ("logout", "ais_index") OR like(name, "login%") OR like(name, "sys_user.%"), mvindex(split(dest, "/"), 2), name=="text_index" AND like(parm1, "%failed_attempts%"), mvindex(split(dest, "/"), 2), true(), null())
EVAL-duration = if(like(name, "login%"), processing_duration, null())
EVAL-signature = if(like(name, "login%"), name, null())
EVAL-signature_id = if(like(name, "login%"), name, null())
EVAL-src = case(like(name, "login%") OR name=="logout", parm2, true(), null())
EVAL-src_user = case(name IN ("logout", "ais_index") OR like(name, "sys_user.%"), user_name, true(), null())
EVAL-user = case(name=="text_index" AND like(parm1, "%failed_attempts%"), null(), name IN ("login", "text_index", "logout"), user_name, name=="login.failed", parm1, name=="ais_index" AND parm1=="user_password", user_name, true(), null())
EVAL-vendor_account = if(len(instance) > 0, instance, null())
EVAL-change_type = case(name IN ("text_index", "logout", "ais_index") OR like(name, "sys_user.%"), "AAA", true(), null())
EVAL-command = case(name IN ("text_index", "logout", "ais_index") OR like(name, "sys_user.%"), name, true(), null())
EVAL-dvc = case(name IN ("text_index", "logout", "ais_index") OR like(name, "sys_user.%"), mvindex(split(dest, "/"), 2), true(), null())
EVAL-object = case(name=="ais_index" AND parm1=="user_password", user_name, name=="logout", user_name, true(), null())
EVAL-object_attrs = case(name=="text_index" AND like(parm1, "%failed_attempts%"), "password", name=="text_index" AND match(parm1, "^\[.*\]$"), replace(parm1, "[\\[\\]]", ""), name=="text_index", "user group", name=="logout", "login session", name=="ais_index" AND parm1=="user_password", "password", name=="ais_index" AND parm1!="user_password", replace(parm1, ",", ", "), like(name, "sys_user.%"), "user", true(), null())
EVAL-object_category = case(name=="text_index" AND like(parm1, "%failed_attempts%"), "user", name=="text_index", "user group", name IN ("logout", "ais_index") OR like(name, "sys_user.%"), "user", true(), null())
EVAL-object_id = case(name=="ais_index" AND parm1=="user_password", user_id, name=="logout", user_id, like(name, "sys_user.%"), parm1, true(), null())
EVAL-result = case(name=="text_index" AND like(parm1, "%failed_attempts%"), replace(parm1, "[\\[\\]]", ""), name IN ("text_index", "logout", "ais_index") OR like(name, "sys_user.%"), state, true(), null())
EVAL-result_id = case(name=="text_index" AND like(parm1, "%failed_attempts%"), replace(parm1, "[\\[\\]]", ""), name IN ("text_index", "logout", "ais_index") OR like(name, "sys_user.%"), state, true(), null())
EVAL-status = case(name=="text_index" AND like(parm1, "%failed_attempts%"), "failure", name IN ("text_index", "logout", "ais_index") OR like(name, "sys_user.%"), "success", true(), null())
EVAL-vendor_product = case(name IN ("text_index", "logout", "ais_index") OR like(name, "sys_user.%"), "servicenow", true(), null())
EVAL-src_user_name = case(name IN ("logout", "ais_index") OR like(name, "sys_user.%"), user_name, true(), null())


[snow:em_event]
EXTRACT-snow_em_event_alert = alert="(?P<snow_em_event_alert>[^\s"]*)"

# For display_value = false, override the following with blank value in local/props.conf under the corresponding stanza. e.g. "FIELDALIAS-severity_name = " without quotes
FIELDALIAS-severity_name = dv_severity AS severity_name
EVAL-source_workflowaction = ltrim(source,"https://")

# For display_value = false, add the following as it is in local/props.conf and uncomment under the corresponding stanza.
#LOOKUP-severity_name = snow_severity_lookup severity AS severity OUTPUTNEW severity_name AS severity_name


[snow:sys_user_group]
rename = snow:sys_user_group_list

[snow:sys_user]
rename = snow:sys_user_list

[snow:cmn_location]
rename = snow:cmn_location_list

[snow:cmdb_ci]
rename = snow:cmdb_ci_list

[snow:sys_choice]
rename = snow:sys_choice_list

[snow:cmdb_ci_list]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:cmn_location_list]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:cmdb_rel_ci]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:cmdb_ci_service]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:cmdb_ci_server]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:cmdb_ci_vm]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:cmdb_ci_infra_service]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:cmdb_ci_db_instance]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:cmdb_ci_app_server]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:sys_user_list]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:sys_user_group_list]
EVAL-source_workflowaction = ltrim(source,"https://")

[snow:sys_choice_list]
EVAL-source_workflowaction = ltrim(source,"https://")

[source::...ta_snow_setup.log*]
sourcetype = ta_snow_setup
SHOULD_LINEMERGE = true
BREAK_ONLY_BEFORE = \d{4}(-\d{2}){2}\s\d{2}(:\d{2}){2}\,\d{3}

[source::...ta_snow_ticket.log*]
sourcetype = ta_snow_ticket
SHOULD_LINEMERGE = true
BREAK_ONLY_BEFORE = \d{4}(-\d{2}){2}\s\d{2}(:\d{2}){2}\,\d{3}

[source::...splunk_ta_snow_main*]
sourcetype = ta_snow
SHOULD_LINEMERGE = true
BREAK_ONLY_BEFORE = \d{4}(-\d{2}){2}\s\d{2}(:\d{2}){2}\,\d{3}

[source::...ta_snow_util.log*]
sourcetype = ta_snow_util
SHOULD_LINEMERGE = true
BREAK_ONLY_BEFORE = \d{4}(-\d{2}){2}\s\d{2}(:\d{2}){2}\,\d{3}
